using UnityEngine;

namespace CSLearn
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // Осноныые типы данных
            // Целочисленные типы
            byte b = 255;          // 1 байт, от 0 до 255
            sbyte sb = -128;      // 1 байт, от -128 до 127
            short s = -32768;     // 2 байта, от -32,768 до 32,767
            ushort us = 65535;    // 2 байта, от 0 до 65,535
            int i = -2147483648;  // 4 байта, от -2,147,483,648 до 2,147,483,647
            uint ui = 4294967295; // 4 байта, от 0 до 4,294,967,295
            long l = -9223372036854775808; // 8 байт, от -9,223,372,036,854,775,808 до 9,223,372,036,854,775,807
            ulong ul = 18446744073709551615; // 8 байт, от 0 до 18,446,744,073,709,551,615
            
            // Числа с плавающей точкой
            float f = 5.7f; // 4 байта, приблизительно от ±1.5 x 10^−45 до ±3.4 x 10^38
            double d = 5.7; // 8 байт, приблизительно от ±5.0 x 10^−324 до ±1.7 x 10^308

            // Символьный тип
            char c = 'A'; // 2 байта, от '\u0000' до '\uffff'

            // Строковый тип
            string str = "Hello, World!"; // Строка символов или charoв

            // Логический тип
            bool bo = true; // 1 байт, принимает значения true или false
        }
    }
}
